//=============================================================================
//
// 的処理 [enemy.h]
// Author : NARITADA SUZUKI
//
//=============================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ENEMY_MAX (60)//敵の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	PosCircle fPosCicle;//中心座標と半径のデータ
	MtxSet mtxset;//マトリックスデータ格納
}ENEMY_DATA;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemy(void);
void SetEnemy(int nNum);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

D3DXVECTOR3 GetEnemyPosition(int nNum);
int GetEnemyLife(int nNum);


#endif
