//=============================================================================
//
// ゲーム中処理 [resultmain.cpp]
// Author : NARITADA SUZUKI
//
//=============================================================================

#include "resultmain.h"
#include "resultbg.h"
#include "input.h"
#include "scene.h"
#include "sound.h"
#include "titlecamera.h"
#include "titleplayer.h"
#include "meshdoom.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//*****************************************************************************
//初期化処理 
//*****************************************************************************
HRESULT InitResult(void)
{
	//結果背景初期化
	if(FAILED(InitResultBG()))
	{
		E_FAIL;
	}
	InitTitlePlayer();
	InitTitleCamera();
	InitMeshDoom(12,12,5000,5000);
	PlaySound(SOUND_LABEL_BGM002);
	return S_OK;
}
//*****************************************************************************
//終了処理 
//*****************************************************************************
void UninitResult(void)
{
	UninitMeshDoom();
	UninitTitlePlayer();
	UninitTitleCamera();
	//結果背景解放
	UninitResultBG();
	StopSound();
}
//*****************************************************************************
//更新処理 
//*****************************************************************************
void UpdateResult(void)
{
	UpdateMeshDoom();
	UpdateTitlePlayer();
	UpdateTitleCamera();
	UpdateResultBG();
		//ボタンでシーン切り替え
	if(GetKeyboardTrigger(DIK_RETURN))
	{
		SetNextScene(MODE_RANKING);
	}
}
//*****************************************************************************
//描画処理 
//*****************************************************************************
void DrawResult(void)
{
	DrawMeshDoom();
	SetTitleCamera();
	DrawTitlePlayer();

	
}

