//=============================================================================
//
// タイトル背景[titlebg.h]
// Author : NARITADA SUZUKI
//
//=============================================================================
#ifndef _TITLESTART_H_
#define _TITLESTART_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TITLESTART_W (256)
#define TITLESTART_H (64)
#define TITLESTART_X (-TITLESTART_W / 2 + SCREEN_WIDTH / 2)
#define TITLESTART_Y (-TITLESTART_H / 2 +  SCREEN_HEIGHT / 2)
//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleStart(void);
void UninitTitleStart(void);
void UpdateTitleStart(void);
void DrawTitleStart(void);

#endif
