//=============================================================================
//
// 地面処理 [wall.h]
// Author : NARITADA SUZUKI
//
//=============================================================================
#ifndef _WALL_H_
#define _WALL_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void InitVertexWall(void);
void DrawWall(void);

#endif
